// Вывести на карту не более 10 меток.
// Ограничение по количеству должно происходить сразу после получения данных с сервера.

// Запрограммировать фильтр «Тип жилья».
// Помните, независимо от того, сколько объявлений соответствует фильтру,
// на карте не должно отображаться больше 10 меток.

// При изменении фильтра скрывать открытый балун с объявлением.

// Убедитесь, что фильтр «Тип жилья» работает корректно. Затем продолжайте.

// Доработайте модуль фильтрации, реализовав все виды фильтров.
//  Все выбранные фильтры применяются вместе: один фильтр не отменяет другие,
//  выбранные до него. Например, после выбора типа жилья можно указать диапазон стоимости
//  и удобства, в таком случае на карте должны показываться только те метки,
//  которые удовлетворяют всем фильтрам сразу. Как в изначальном состоянии,
//  так и при изменении фильтров, на карте должно показываться не более 10 меток.

// Воспользуйтесь приёмом «устранение дребезга», чтобы при переключении фильтра обновление меток,
//  подходящих под фильтры, происходило не чаще, чем один раз в полсекунды.
